CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_can.h
/* CAN_PN_EDLC */
#define CAN_PN_EDLC_DLCEHT             BITS(0, 3)                                        /*!< DLC expected high threshold in Pretended Networking mode */
#define CAN_PN_EDLC_DLCELT             BITS(16, 19)                                      /*!< DLC expected low threshold in Pretended Networking mode */

/* CAN_PN_EDL0 */
#define CAN_PN_EDL0_DB3ELT             BITS(0, 7)                                        /*!< data byte 3 expected low threshold in Pretended Networking mode */
#define CAN_PN_EDL0_DB2ELT             BITS(8, 15)                                       /*!< data byte 2 expected low threshold in Pretended Networking mode */
#define CAN_PN_EDL0_DB1ELT             BITS(16, 23)                                      /*!< data byte 1 expected low threshold in Pretended Networking mode */
#define CAN_PN_EDL0_DB0ELT             BITS(24, 31)                                      /*!< data byte 0 expected low threshold in Pretended Networking mode */

/* CAN_PN_EDL1 */
#define CAN_PN_EDL1_DB7ELT             BITS(0, 7)                                        /*!< data byte 7 expected low threshold in Pretended Networking mode */
#define CAN_PN_EDL1_DB6ELT             BITS(8, 15)                                       /*!< data byte 6 expected low threshold in Pretended Networking mode */
#define CAN_PN_EDL1_DB5ELT             BITS(16, 23)                                      /*!< data byte 5 expected low threshold in Pretended Networking mode */
#define CAN_PN_EDL1_DB4ELT             BITS(24, 31)                                      /*!< data byte 4 expected low threshold in Pretended Networking mode */

/* CAN_PN_IFEID1 */
#define CAN_PN_IFEID1_IDFD_EHT         BITS(0, 28)                                       /*!< IDE filter data in Pretended Networking mode */
#define CAN_PN_IFEID1_RTRFD            BIT(29)                                           /*!< RTR filter data in Pretended Networking mode */
#define CAN_PN_IFEID1_IDEFD            BIT(30)                                           /*!< ID filter data / ID expected high threshold in Pretended Networking mode */

/* CAN_PN_DF0EDH0 */
#define CAN_PN_DF0EDH0_DB3FD_EHT       BITS(0, 7)                                        /*!< data byte 3 filter data / data byte 3 expected high threshold in Pretended Networking mode */
#define CAN_PN_DF0EDH0_DB2FD_EHT       BITS(8, 15)                                       /*!< data byte 2 filter data / data byte 2 expected high threshold in Pretended Networking mode */
#define CAN_PN_DF0EDH0_DB1FD_EHT       BITS(16, 23)                                      /*!< data byte 1 filter data / data byte 1 expected high threshold in Pretended Networking mode */
#define CAN_PN_DF0EDH0_DB0FD_EHT       BITS(24, 31)                                      /*!< data byte 0 filter data / data byte 0 expected high threshold in Pretended Networking mode */

/* CAN_PN_DF1EDH1 */
#define CAN_PN_DF1EDH1_DB7FD_EHT       BITS(0, 7)                                        /*!< data byte 7 filter data / data byte 7 expected high threshold in Pretended Networking mode */
#define CAN_PN_DF1EDH1_DB6FD_EHT       BITS(8, 15)                                       /*!< data byte 6 filter data / data byte 6 expected high threshold in Pretended Networking mode */
#define CAN_PN_DF1EDH1_DB5FD_EHT       BITS(16, 23)                                      /*!< data byte 5 filter data / data byte 5 expected high threshold in Pretended Networking mode */
#define CAN_PN_DF1EDH1_DB4FD_EHT       BITS(24, 31)                                      /*!< data byte 4 filter data / data byte 4 expected high threshold in Pretended Networking mode */

/* CAN_PN_RWMxCS, x = 0..3 */
#define CAN_PN_RWMXCS_RDLC             BITS(16, 19)                                      /*!< received DLC bits */
#define CAN_PN_RWMXCS_RRTR             BIT(20)                                           /*!< received RTR bit */
#define CAN_PN_RWMXCS_RIDE             BIT(21)                                           /*!< received IDE bit */
#define CAN_PN_RWMXCS_RSRR             BIT(22)                                           /*!< received SRR bit */

/* CAN_PN_RWMxI, x = 0..3 */
#define CAN_PN_RWMXI_RID               BITS(0, 28)                                       /*!< received ID bits */

/* CAN_PN_RWMxD0, x = 0..3 */
#define CAN_PN_RWMXD0_RDB3             BITS(0, 7)                                        /*!< received data byte 3 */
#define CAN_PN_RWMXD0_RDB2             BITS(8, 15)                                       /*!< received data byte 2 */
#define CAN_PN_RWMXD0_RDB1             BITS(16, 23)                                      /*!< received data byte 1 */
#define CAN_PN_RWMXD0_RDB0             BITS(24, 31)                                      /*!< received data byte 0 */

/* CAN_PN_RWMxD1, x = 0..3 */
#define CAN_PN_RWMXD1_RDB7             BITS(0, 7)                                        /*!< received data byte 7 */
#define CAN_PN_RWMXD1_RDB6             BITS(8, 15)                                       /*!< received data byte 6 */
#define CAN_PN_RWMXD1_RDB5             BITS(16, 23)                                      /*!< received data byte 5 */
#define CAN_PN_RWMXD1_RDB4             BITS(24, 31)                                      /*!< received data byte 4 */

/* CAN_FDCTL */
#define CAN_FDCTL_TDCV                 BITS(0, 5)                                        /*!< transmitter delay compensation value */
#define CAN_FDCTL_TDCO                 BITS(8, 12)                                       /*!< transmitter delay compensation offset */
#define CAN_FDCTL_TDCS                 BIT(14)                                           /*!< transmitter delay compensation status */
#define CAN_FDCTL_TDCEN                BIT(15)                                           /*!< transmitter delay compensation enable */
#define CAN_FDCTL_MDSZ                 BITS(16, 17)                                      /*!< mailbox data size */
#define CAN_FDCTL_BRSEN                BIT(31)                                           /*!< bit rate of data switch enable */

/* CAN_FDBT */
#define CAN_FDBT_DPBS2                 BITS(0, 2)                                        /*!< phase buffer segment 2 for data bit time */
#define CAN_FDBT_DPBS1                 BITS(5, 7)                                        /*!< phase buffer segment 1 for data bit time */
#define CAN_FDBT_DPTS                  BITS(10, 14)                                      /*!< propagation time segment for data bit time */
#define CAN_FDBT_DSJW                  BITS(16, 18)                                      /*!< resynchronization jump width for data bit time */
#define CAN_FDBT_DBAUDPSC              BITS(20, 29)                                      /*!< baud rate prescaler for data bit time */

/* CAN_CRCCFD */
#define CAN_CRCCFD_CRCTCI              BITS(0, 20)                                       /*!< transmitted CRC value for classical and ISO / non-ISO frames */
#define CAN_CRCCFD_ANTM                BITS(24, 28)                                      /*!< associated number of mailbox for transmitting the CRCTCI[20:0] value */

/* CAN_MDES0 */
#define CAN_MDES0_TIMESTAMP            BITS(0, 15)                                       /*!< free-running counter timestamp */
#define CAN_MDES0_DLC                  BITS(16, 19)                                      /*!< data length code in bytes */
#define CAN_MDES0_RTR                  BIT(20)                                           /*!< remote transmission request */
#define CAN_MDES0_IDE                  BIT(21)                                           /*!< ID extended bit */
#define CAN_MDES0_SRR                  BIT(22)                                           /*!< substitute remote request */
#define CAN_MDES0_CODE                 BITS(24, 27)                                      /*!< mailbox code */
#define CAN_MDES0_ESI                  BIT(29)                                           /*!< error state indicator */
#define CAN_MDES0_BRS                  BIT(30)                                           /*!< bit rate switch */
#define CAN_MDES0_FDF                  BIT(31)                                           /*!< FD format indicator */

/* CAN_MDES1 */
#define CAN_MDES1_ID_EXD               BITS(0, 17)                                       /*!< identifier for extended frame */
#define CAN_MDES1_ID_STD               BITS(18, 28)                                      /*!< identifier for standard frame */
#define CAN_MDES1_PRIO                 BITS(29, 31)                                      /*!< local priority */

/* CAN_FDES0 */
#define CAN_FDES0_TIMESTAMP            BITS(0, 15)                                       /*!< free-running counter timestamp */
#define CAN_FDES0_DLC                  BITS(16, 19)                                      /*!< data length code in bytes */
#define CAN_FDES0_RTR                  BIT(20)                                           /*!< remote transmission request */
#define CAN_FDES0_IDE                  BIT(21)                                           /*!< ID extended bit */
#define CAN_FDES0_SRR                  BIT(22)                                           /*!< substitute remote request */
#define CAN_FDES0_IDFMN                BITS(23, 31)                                      /*!< identifier filter matching number */

