CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_can.h
/* CAN interrupt flags */
typedef enum {
    /* interrupt flags in ERR1 register */
    CAN_INT_FLAG_ERR_SUMMARY      = CAN_REGIDX_BIT(ERR1_REG_OFFSET, 1U),                 /*!< error summary interrupt flag */
    CAN_INT_FLAG_BUSOFF           = CAN_REGIDX_BIT(ERR1_REG_OFFSET, 2U),                 /*!< bus off interrupt flag */
    CAN_INT_FLAG_RX_WARNING       = CAN_REGIDX_BIT(ERR1_REG_OFFSET, 16U),                /*!< receive warning interrupt flag */
    CAN_INT_FLAG_TX_WARNING       = CAN_REGIDX_BIT(ERR1_REG_OFFSET, 17U),                /*!< transmit warning interrupt flag */
    CAN_INT_FLAG_BUSOFF_RECOVERY  = CAN_REGIDX_BIT(ERR1_REG_OFFSET, 19U),                /*!< bus off recovery interrupt flag */
    CAN_INT_FLAG_ERR_SUMMARY_FD   = CAN_REGIDX_BIT(ERR1_REG_OFFSET, 20U),                /*!< fd error summary interrupt flag */
    /* interrupt flags in STAT register */
    CAN_INT_FLAG_MB0              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 0U),                 /*!< mailbox 0 interrupt flag */
    CAN_INT_FLAG_MB1              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 1U),                 /*!< mailbox 1 interrupt flag */
    CAN_INT_FLAG_MB2              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 2U),                 /*!< mailbox 2 interrupt flag */
    CAN_INT_FLAG_MB3              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 3U),                 /*!< mailbox 3 interrupt flag */
    CAN_INT_FLAG_MB4              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 4U),                 /*!< mailbox 4 interrupt flag */
    CAN_INT_FLAG_MB5              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 5U),                 /*!< mailbox 5 interrupt flag */
    CAN_INT_FLAG_MB6              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 6U),                 /*!< mailbox 6 interrupt flag */
    CAN_INT_FLAG_MB7              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 7U),                 /*!< mailbox 7 interrupt flag */
    CAN_INT_FLAG_MB8              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 8U),                 /*!< mailbox 8 interrupt flag */
    CAN_INT_FLAG_MB9              = CAN_REGIDX_BIT(STAT_REG_OFFSET, 9U),                 /*!< mailbox 9 interrupt flag */
    CAN_INT_FLAG_MB10             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 10U),                /*!< mailbox 10 interrupt flag */
    CAN_INT_FLAG_MB11             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 11U),                /*!< mailbox 11 interrupt flag */
    CAN_INT_FLAG_MB12             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 12U),                /*!< mailbox 12 interrupt flag */
    CAN_INT_FLAG_MB13             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 13U),                /*!< mailbox 13 interrupt flag */
    CAN_INT_FLAG_MB14             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 14U),                /*!< mailbox 14 interrupt flag */
    CAN_INT_FLAG_MB15             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 15U),                /*!< mailbox 15 interrupt flag */
    CAN_INT_FLAG_MB16             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 16U),                /*!< mailbox 16 interrupt flag */
    CAN_INT_FLAG_MB17             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 17U),                /*!< mailbox 17 interrupt flag */
    CAN_INT_FLAG_MB18             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 18U),                /*!< mailbox 18 interrupt flag */
    CAN_INT_FLAG_MB19             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 19U),                /*!< mailbox 19 interrupt flag */
    CAN_INT_FLAG_MB20             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 20U),                /*!< mailbox 20 interrupt flag */
    CAN_INT_FLAG_MB21             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 21U),                /*!< mailbox 21 interrupt flag */
    CAN_INT_FLAG_MB22             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 22U),                /*!< mailbox 22 interrupt flag */
    CAN_INT_FLAG_MB23             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 23U),                /*!< mailbox 23 interrupt flag */
    CAN_INT_FLAG_MB24             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 24U),                /*!< mailbox 24 interrupt flag */
    CAN_INT_FLAG_MB25             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 25U),                /*!< mailbox 25 interrupt flag */
    CAN_INT_FLAG_MB26             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 26U),                /*!< mailbox 26 interrupt flag */
    CAN_INT_FLAG_MB27             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 27U),                /*!< mailbox 27 interrupt flag */
    CAN_INT_FLAG_MB28             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 28U),                /*!< mailbox 28 interrupt flag */
    CAN_INT_FLAG_MB29             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 29U),                /*!< mailbox 29 interrupt flag */
    CAN_INT_FLAG_MB30             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 30U),                /*!< mailbox 30 interrupt flag */
    CAN_INT_FLAG_MB31             = CAN_REGIDX_BIT(STAT_REG_OFFSET, 31U),                /*!< mailbox 31 interrupt flag */
    CAN_INT_FLAG_FIFO_AVAILABLE   = CAN_REGIDX_BIT(STAT_REG_OFFSET, 5U),                 /*!< fifo availabe interrupt flag */
    CAN_INT_FLAG_FIFO_WARNING     = CAN_REGIDX_BIT(STAT_REG_OFFSET, 6U),                 /*!< fifo warning interrupt flag */
    CAN_INT_FLAG_FIFO_OVERFLOW    = CAN_REGIDX_BIT(STAT_REG_OFFSET, 7U),                 /*!< fifo overflow interrupt flag */
    /* interrupt flags in PN_STAT register */
    CAN_INT_FLAG_WAKEUP_MATCH     = CAN_REGIDX_BIT(PN_STAT_REG_OFFSET, 16U),             /*!< Pretended Networking match interrupt flag */
    CAN_INT_FLAG_WAKEUP_TIMEOUT   = CAN_REGIDX_BIT(PN_STAT_REG_OFFSET, 17U)              /*!< Pretended Networking timeout wakeup interrupt flag */
} can_interrupt_flag_enum;

/* operation modes */
typedef enum {
    CAN_NORMAL_MODE               = 0U,                                                  /*!< normal mode */
    CAN_MONITOR_MODE              = 1U,                                                  /*!< monitor mode */
    CAN_LOOPBACK_SILENT_MODE      = 2U,                                                  /*!< loopback mode */
    CAN_INACTIVE_MODE             = 3U,                                                  /*!< inactive mode */
    CAN_DISABLE_MODE              = 4U,                                                  /*!< disable mode */
    CAN_PN_MODE                   = 5U                                                   /*!< Pretended Networking mode */
} can_operation_modes_enum;

/* initiliaze parameter type */
typedef enum {
    CAN_INIT_STRUCT               = 0U,                                                  /*!< CAN initiliaze parameters struct */
    CAN_FD_INIT_STRUCT            = 1U,                                                  /*!< CAN FD parameters struct */
    CAN_FIFO_INIT_STRUCT          = 2U,                                                  /*!< CAN fifo parameters struct */
    CAN_PN_MODE_INIT_STRUCT       = 3U,                                                  /*!< Pretended Networking mode parameter strcut */
    CAN_PN_MODE_FILTER_STRUCT     = 4U,                                                  /*!< Pretended Networking mode filter parameter strcut */
    CAN_MDSC_STRUCT               = 5U,                                                  /*!< mailbox descriptor strcut */
    CAN_FDES_STRUCT               = 6U,                                                  /*!< Rx fifo descriptor strcut */
    CAN_FIFO_ID_FILTER_STRUCT     = 7U,                                                  /*!< Rx fifo id filter strcut */
    CAN_CRC_STRUCT                = 8U,                                                  /*!< CRC strcut */
    CAN_ERRCNT_STRUCT             = 9U,                                                  /*!< error counter strcut */
} can_struct_type_enum;

/* error state indicator */
typedef enum {
    CAN_ERROR_STATE_ACTIVE        = 0U,                                                  /*!< CAN in error active */
    CAN_ERROR_STATE_PASSIVE       = 1U,                                                  /*!< CAN in error passive */
    CAN_ERROR_STATE_BUS_OFF       = 2U                                                   /*!< CAN in bus off */
} can_error_state_enum;

/* error counter structure */
typedef struct {
    uint8_t fd_data_phase_rx_errcnt;                                                     /*!< receive error counter for data phase of FD frames with BRS bit set */
    uint8_t fd_data_phase_tx_errcnt;                                                     /*!< transmit error count for the data phase of FD frames with BRS bit set */
    uint8_t rx_errcnt;                                                                   /*!< receive error count defined by the CAN standard */
    uint8_t tx_errcnt;                                                                   /*!< transmit error count defined by the CAN standard */
} can_error_counter_struct;

/* CAN initiliaze parameters structure */
typedef struct {
    uint32_t internal_counter_source;                                                    /*!< internal counter source */
    uint32_t mb_tx_order;                                                                /*!< mailbox transmit order */
    uint32_t mb_rx_ide_rtr_type;                                                         /*!< IDE and RTR field fitler type  */
    uint32_t mb_remote_frame;                                                            /*!< remote request frame is stored */
    uint8_t self_reception;                                                              /*!< enable or disable self reception */
    uint8_t mb_tx_abort_enable;                                                          /*!< enable or disable transmit abort */
    uint8_t local_priority_enable;                                                       /*!< enable or disable local priority */
    uint8_t rx_private_filter_queue_enable;                                              /*!< private filter and queue enable */
    uint32_t edge_filter_enable;                                                         /*!< edge filter enable*/
    uint32_t protocol_exception_enable;                                                  /*!< protocol exception enable */
    uint32_t rx_filter_order;                                                            /*!< receive filter order */
    uint32_t memory_size;                                                                /*!< memory size */
    uint32_t mb_public_filter;                                                           /*!< mailbox public filter */
    uint32_t prescaler;                                                                  /*!< baudrate prescaler */
    uint8_t resync_jump_width;                                                           /*!< resynchronization jump width */
    uint8_t prop_time_segment;                                                           /*!< propagation time segment */
    uint8_t time_segment_1;                                                              /*!< time segment 1 */
    uint8_t time_segment_2;                                                              /*!< time segment 2 */
} can_parameter_struct;

/* mailbox descriptor struct */
typedef struct {
    uint32_t timestamp : 16;                                                             /*!< free-running counter timestamp */
    uint32_t dlc : 4;                                                                    /*!< data length code in bytes */
    uint32_t rtr : 1;                                                                    /*!< remote transmission request */
    uint32_t ide : 1;                                                                    /*!< ID extended bit */
    uint32_t srr : 1;                                                                    /*!< substitute remote request */
    uint32_t reserve1 : 1;                                                               /*!< reserve bit 1 */
    uint32_t code : 4;                                                                   /*!< mailbox code */
    uint32_t reserve2 : 1;                                                               /*!< reserve bit 2 */
    uint32_t esi : 1;                                                                    /*!< error state indicator */
    uint32_t brs : 1;                                                                    /*!< bit rate switch */
    uint32_t fdf : 1;                                                                    /*!< FD format indicator */
    uint32_t id : 29;                                                                    /*!< identifier for frame */
    uint32_t prio : 3;                                                                   /*!< local priority */
    uint32_t *data;                                                                      /*!< data */
    uint32_t data_bytes;                                                                 /*!< data bytes */
    uint8_t padding;                                                                     /*!< FD mode padding data */
} can_mailbox_descriptor_struct;

/* fifo descriptor struct */
typedef struct {
    uint32_t timestamp : 16;                                                             /*!< free-running counter timestamp */
    uint32_t dlc : 4;                                                                    /*!< data length code in bytes */
    uint32_t rtr : 1;                                                                    /*!< remote transmission request */
    uint32_t ide : 1;                                                                    /*!< ID extended bit */
    uint32_t srr : 1;                                                                    /*!< substitute remote request */
    uint32_t idhit : 9;                                                                  /*!< identifier filter matching number */
    uint32_t id;                                                                         /*!< identifier for frame */
    uint32_t data[2];                                                                    /*!< fifo data */
} can_rx_fifo_struct;

/* FD initiliaze parameter struct */
typedef struct {
    uint32_t iso_can_fd_enable;                                                          /*!< ISO CAN FD protocol enable */
    uint32_t bitrate_switch_enable;                                                      /*!< data bit rate switch */
    uint32_t mailbox_data_size;                                                          /*!< mailbox data size */
    uint32_t tdc_enable;                                                                 /*!< trnasmitter delay compensation enable */
    uint32_t tdc_offset;                                                                 /*!< trnasmitter delay compensation offset */
    uint32_t prescaler;                                                                  /*!< baudrate prescaler */
    uint8_t resync_jump_width;                                                           /*!< resynchronization jump width */
    uint8_t prop_time_segment;                                                           /*!< propagation time segment */
    uint8_t time_segment_1;                                                              /*!< time segment 1 */
    uint8_t time_segment_2;                                                              /*!< time segment 2 */
} can_fd_parameter_struct;

